In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
school_a = pd.read_csv('SchoolA.csv')
school_b = pd.read_csv('SchoolB.csv')
school_c = pd.read_csv('SchoolC.csv')

In [3]:
school_a

   student_id student_name
0           1        Alice
1           2          Bob

In [4]:
school_b

   student_id student_name
0           3          Tom

In [5]:
school_c

   student_id student_name
0           3          Tom
1           2        Jerry
2          10        Alice

In [8]:
merge = pd.merge(school_a,school_b, how = 'cross').merge(school_c,how = 'cross')
res = merge.query("student_id_x != student_id_y and student_id_x != student_id and student_id_y != student_id and student_name_x != student_name_y and student_name_x != student_name and student_name_y != student_name")
res[['student_name_x','student_name_y','student_name']].rename(columns = {'student_name_x':'member_A','student_name_y':'member_B','student_name':'member_C'})

  member_A member_B member_C
1    Alice      Tom    Jerry
5      Bob      Tom    Alice